
/* Напишете израз, който да проверява дали третия бит на дадено число е 1 или 0 */

public class ThirdBit {

	public static void main(String[] args) {
		//Дефиниране на числото
		int number = 15; // 0000 1111
		int position = 3;//Задаване на позицията на която ще търсим бита
		
		//Задаване на маска - двоичен вид на числото 1 измсестено с броя позиции на ляво
		int mask = 1 << position; // 0000 0001 ---> 0000 1000
		
		//Използване на & за получаване на 3-я бит
		/*
		 * 0000 1111
		 * &
		 * 0000 1000
		 * ---------
		 * 0000 1000
		 */
		int result = number & mask; //0000 1000
		
		//Изместване на резултата с броя позиции на дясно
		result = result >> position; //0000 1000 ----> 0000 0001
		
		//Печатаме резултата
		System.out.println(result); //1
	}

}
